<template> 
    <div class="container mt-10">
        <div class="row mt-5 col-md-12">       
            <div class="col-md-6 d-flex justify-content-center align-items-center">
                <img src="https://picsum.photos/id/544/300/200" alt="">        
            </div>  
            
            <div class="col-md-6 d-flex justify-content-center align-items-center flex-column px-10 text-start">
                <p class="fw-bold">背景設定</p>
                《原神》設定的世界名為「提瓦特」，在這個世界上存在著風、火、雷、水、冰、草、岩七種元素力量，被神選中者將被授予啟動元素力量的「神之眼」，
                登上天空島的人將擁有「神之心」。從其他世界漂流而來的「旅行者」與性格各異、能力獨特的同伴們一起旅行七國，在尋找失散親人的過程中逐漸發掘「原神」的真相。
                七國是在目前故事的時間線下，由塵世七執政管轄的七個政權的合稱。<br>
                蒙德是位於提瓦特大陸東北部的城邦。信奉「自由」之神巴巴托斯，是塵世七國中的風之國度。該地區主體以中世紀德國一帶的西歐地區為原型進行設計，而龍脊雪山部分則是以阿爾卑斯山的馬特洪峰為原型。<br>
                璃月是位於提瓦特大陸東方的港灣。信奉「契約」之神摩拉克斯，是塵世七國中的岩之國度。該地區以古代中國為原型進行設計，美術設計上參考了位於湖南張家界的武陵源景區、四川阿壩的黃龍風景名勝區和廣西桂林的桂林山水。<br>
                稻妻是位於提瓦特大陸遠東的群島。信奉「永恆」之神巴爾，是塵世七國中的雷之國度。該地區以幕府日本為原型進行設計。
            </div>
        </div>
        <div class="row mt-5 col-md-12">   
            <div class="col-md-6 d-flex justify-content-center align-items-center flex-column px-10 text-start">
                <p class="fw-bold">登場角色</p>
                《原神》遊戲的主角是旅行者空、熒，一對因故國毀滅而在無數世界中漂流的兄妹。因遭遇陌生神明阻攔而被迫分離，於是踏上了尋找親人的旅程。在旅行開始時，派蒙被旅行者從湖中釣起，
                主動擔任精靈的任務與旅行者一同遊歷提瓦特，並在旅途中與各色人等相遇。
            </div>    
            <div class="col-md-6 d-flex justify-content-center align-items-center">
                <img src="https://picsum.photos/id/544/300/200" alt="">        
            </div>              

        </div>
        <div class="site-wrap col-md-12">    
                <p class="fw-bold">主線劇情</p>
                因故國毀滅，而在無數世界中漂流的兄妹，準備離開幻想世界「提瓦特」前往下一個世界時，遭陌生神靈「『天理』的維繫者」阻攔，其中一位被神靈帶走，另一位失去力量陷入沉睡，並在不知多少年後甦醒，開始於提瓦特流浪。在流浪途中，派蒙被旅行者釣起，開始擔任旅行者的精靈。<br>
                <img src="https://picsum.photos/id/684/300/200" class="align-left" alt="">
                <p> 兩個月後，旅行者從墜星山谷啟程前往蒙德城，幫助擊退了前來侵襲的風魔龍。在準備調查風魔龍特瓦林前，遇見吟遊詩人溫迪，並受其請求盜取天空之琴，經過一番波折從愚人眾手中取回。在恢復天空之琴力量後，特瓦林在溫迪的琴聲中到來，卻在深淵法師的蠱惑下憤而離開。此時溫迪的真實身分得以顯現，即風神巴巴托斯。<br>
                在突破重重障礙之後，旅行者成功解鎖光之封印迎來與特瓦林的正面對決。旅行者成功解救特瓦林，回到蒙德大教堂歸還天空之琴。然而，離開教堂時，愚人眾執行官「女士」突然出現奪走了溫迪的神之心，並將旅行者打昏。醒來後，在溫迪的指引下，旅行者踏上了前往璃月的旅途。<br></p>
                <img src="https://picsum.photos/id/684/300/200" class="align-right" alt="">
                <p>旅行者抵達璃月港，卻發現岩神被刺，在愚人眾執行官「公子」的指引下前去請求仙人幫助，並與「往生堂」的客卿鍾離一同籌辦「送仙典儀」，又在璃月七星之一的凝光暗示下確認了愚人眾的陰謀。籌辦完畢，仙人正與七星在城外對峙，旅行者前往黃金屋阻止「公子」奪取神之心，卻發現神之心並不在黃金屋，「公子」為逼岩神現身召喚出遠古魔神。<br>
                
                一番激戰後，凝光決定犧牲群玉閣鎮壓魔神。仙人與七星重歸於好，旅行者前去北國銀行，發現鍾離就是岩神摩拉克斯，與「冰之女皇」達成契約將神之心交與「女士」。離開北國銀行，送仙典儀照常進行，鍾離提到稻妻正處於「鎖國令」與「眼狩令」之中。旅行者在一處遺蹟中意外與唯一的至親重逢。
                然而，對方卻已加入深淵教團，在告誡旅行者要抵達旅行的終點後離開。<br></p>
                <p> 旅行者在南十字武鬥會中獲勝，乘死兆星號突破雷暴來到稻妻，並在托馬幫助下安身。登上鳴神島後，旅行者在社奉行大小姐神里綾華的請求下目睹失去神之眼的三人的處境。             
                得知托馬被抓，旅行者匆忙趕往現場，卻不敵雷電將軍的神罰，好在托馬幫忙成功逃離。旅行者投奔反抗軍，並受邀來到反抗軍本部，晉升為隊長。然而此時，一些軍士卻在愚人眾蠱惑下使用了透支生命的邪眼。<br></p>
                <img src="https://picsum.photos/id/684/300/200" class="align-left" alt="">
                旅行者不慎落入愚人眾執行官「散兵」的陷阱中，好在被鳴神大社宮司八重神子救走。在一系列計謀下，旅行者成功來到天守閣，在「御前決鬥」中戰勝「女士」，並得以離開，反抗軍已兵臨其下。「無想的一刀」突然砍來，被萬葉接下，旅行者趁此機會見到了真正的雷神影。<br>
                在民眾願望的支援下，旅行者戰勝並成功說服她廢除眼狩令。風波暫息，旅行者卻得知，「神之心」已被八重神子交與「散兵」。她還推薦旅行者下一站前往須彌。<br> 
        </div>

    </div>  
 
</template>
<style>
    .site-wrap {      
      margin: 100px auto;
      background: white;      
      text-align: justify;
    }

    .align-left {
      float: left;
      margin-right: 20px;
    }

    .align-right {
      float: right;
      margin-left: 20px;
    }

</style>