<template>
    <div class="ruler2">
        <p>＂人類無法將腦內所有資訊同時關聯到一起，我想，這算是世間最大的仁慈了。</p>
        <p>我們身處恬然寧靜的無知之島，位於黑獰無邊的大海中央，也並非註定要駛向遠方一探究竟。</p>
        <p>各種科學在其所屬方向竭力前行，雖然至今尚未對我們造成傷害，</p>
        <p>但終有一天，各不相關的知識彼此碰撞，會揭開那駭人的真相，</p>
        <p>點明我們在這片可怕光景中所處的方位。</p>
        <p>這份光明是如此恐怖而致命，我們若不想失心而瘋，</p>
        <p>就必須遠遠逃開，躲進一個新的黑暗時代去尋找平和與安寧。＂</p>
        <p class="p1">——H.P.洛夫克拉夫特，《克蘇魯的呼喚》</p>
    </div>
</template>
<style >
    .ruler2{
        background: black;
        color: white;
        padding:  30px 0;
    }
    .ruler2 > .p1{
        font-weight: bold;
    }
</style>